var hadisList = [
  "Шын мәнінде, Аллаһ тағала сендердің сыртқыдене-бітімдеріңе не түр-тұрпаттарыңа емес,жүректерің мен амалдарыңа қарайды",
  "Кімде-кімжақсылықжасауға ниеттеніп бірақжасамаса, Хақ тағала оны толық жасалғанбір жақсылық есебінде жазады. Егер дежақсылық жасауды ұйғарып, әрі оны жүзегеасырса, Аллаһ тағала сол бір ғана жақсылығыүшін он сауаптан бастап, жеті жүз есегедейін, тіпті, одан да еселеп сауап жазады.",
  "Аллаһ тағала: “Ей, Адам баласы! Дүние-мүлкіңді игі жолда жұмсағын. Сонда саған дамолынан берілетін болады*” – деп айтты.",
  "Садақа бергеннен адамның дәулеті ешуақытта ортаймаған. Аллаһ тағала өзгелергекешіріммен қараған құлының мерейін үстемқылады. Сондай-ақ, Аллаһ үшін кішіпейілболған әрбір адамның дәрежесін өсіреді.",
  "Су отты қалай сөндірсе, садақа да дәл солайкүнәларды жояды."
];

function getRandomIndex(array) {
  return Math.floor(Math.random() * array.length);
}

function changeHadis() {

  var hadisElement = document.getElementById('hadis');

  var randomIndex = getRandomIndex(hadisList);

  hadisElement.textContent = hadisList[randomIndex];
}

document.getElementById('knopkadagy').addEventListener('click', changeHadis);

