var hadisList = [
  "Шын мәнінде, Аллаһ тағала сендердің сыртқыдене-бітімдеріңе не түр-тұрпаттарыңа емес, жүректерің мен амалдарыңа қарайды.",
  "Кімде-кім жақсылық жасауға ниеттеніп бірақ жасамаса, Хақ тағала оны толық жасалған бір жақсылық есебінде жазады. Егер де жақсылық жасауды ұйғарып, әрі оны жүзеге асырса, Аллаһ тағала сол бір ғана жақсылығы үшін он сауаптан бастап, жеті жүз есеге дейін, тіпті, одан да еселеп сауап жазады.",
  "Аллаһ тағала: “Ей, Адам баласы! Дүние-мүлкіңді игі жолда жұмсағын. Сонда саған дамолынан берілетін болады” – деп айтты.",
  "Садақа бергеннен адамның дәулеті еш уақытта ортаймаған. Аллаһ тағала өзгелерге кешіріммен қараған құлының мерейін үстем қылады. Сондай-ақ, Аллаһ үшін кішіпейіл болған әрбір адамның дәрежесін өсіреді.",
  "Су отты қалай сөндірсе, садақа да дәл солай күнәларды жояды.",
  "Бір күні бір күніне ұқсаған адам ұтылды.",
  "Шынайы сабыр – соққының алғашқы тиген сәтіндегі сабыр.",
  "Аллаһ тағала мұсылман құлының басына келетін шаршап-шалдығу, ұзаққа созылған ауру-сырқау, уайым, құса-мұң, күйініш және қайғы-қасірет секілді қандай да бір ауыртпалық үшін, тіпті қолына немесе аяғына кірген кішкене тікен үшін де күнәларын жарылқап кешіреді."
];

function getRandomIndex(array) {
  return Math.floor(Math.random() * array.length);
}

function changeHadis() {

  var hadisElement = document.getElementById('hadis');

  var randomIndex = getRandomIndex(hadisList);

  hadisElement.textContent = hadisList[randomIndex];
}

document.getElementById('knopkadagy').addEventListener('click', changeHadis);

